ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB2/inc/SI_EFM8UB2_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  EFM8UB20F32G_QFN32
//  EFM8UB20F32G_QFP32
//  EFM8UB20F32G_QFP48
//  EFM8UB20F64G_QFN32
//  EFM8UB20F64G_QFP32
//  EFM8UB20F64G_QFP48

#ifndef SI_EFM8UB2_REGISTER_ENUMS_H
#define SI_EFM8UB2_REGISTER_ENUMS_H

//Standard device includes
#include "SI_EFM8UB2_Defs.h"
//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF_ADLJST__BMASK           0x04 ///< ADC0 Left Justify Select                   
#define ADC0CF_ADLJST__SHIFT           0x02 ///< ADC0 Left Justify Select                   
#define ADC0CF_ADLJST__RIGHT_JUSTIFIED 0x00 ///< Data in the ADC0H:ADC0L registers is right-
                                            ///< justified.                                 
#define ADC0CF_ADLJST__LEFT_JUSTIFIED  0x04 ///< Data in the ADC0H:ADC0L registers is left- 
                                            ///< justified.                                 
                                                                                            
#define ADC0CF_ADSC__FMASK             0xF8 ///< SAR Clock Divider                          
#define ADC0CF_ADSC__SHIFT             0x03 ///< SAR Clock Divider                          
                                                                                            
//------------------------------------------------------------------------------
// ADC0CN0 Enums (ADC0 Control @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN0_ADCM__FMASK         0x07 ///< Start of Conversion Mode Select                   
#define ADC0CN0_ADCM__SHIFT         0x00 ///< Start of Conversion Mode Select                   
#define ADC0CN0_ADCM__ADBUSY        0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN0_ADCM__TIMER0        0x01 ///< ADC0 conversion initiated on overflow of Timer 0. 
#define ADC0CN0_ADCM__TIMER2        0x02 ///< ADC0 conversion initiated on overflow of Timer 2. 
#define ADC0CN0_ADCM__TIMER1        0x03 ///< ADC0 conversion initiated on overflow of Timer 1. 
#define ADC0CN0_ADCM__CNVSTR        0x04 ///< ADC0 conversion initiated on rising edge of       
                                         ///< CNVSTR.                                           
#define ADC0CN0_ADCM__TIMER3        0x05 ///< ADC0 conversion initiated on overflow of Timer 3. 
#define ADC0CN0_ADCM__TIMER4        0x06 ///< ADC0 conversion initiated on overflow of Timer 4. 
#define ADC0CN0_ADCM__TIMER5        0x07 ///< ADC0 conversion initiated on overflow of Timer 5. 
                                                                                                
#define ADC0CN0_ADWINT__BMASK       0x08 ///< Window Compare Interrupt Flag                     
#define ADC0CN0_ADWINT__SHIFT       0x03 ///< Window Compare Interrupt Flag                     
#define ADC0CN0_ADWINT__NOT_SET     0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN0_ADWINT__SET         0x08 ///< An ADC window compare event occurred.             
                                                                                                
#define ADC0CN0_ADBUSY__BMASK       0x10 ///< ADC Busy                                          
#define ADC0CN0_ADBUSY__SHIFT       0x04 ///< ADC Busy                                          
#define ADC0CN0_ADBUSY__NOT_SET     0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN0_ADBUSY__SET         0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                         ///< conversion.                                       
                                                                                                
#define ADC0CN0_ADINT__BMASK        0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN0_ADINT__SHIFT        0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN0_ADINT__NOT_SET      0x00 ///< ADC0 has not completed a conversion since the last
                                         ///< time ADINT was cleared.                           
#define ADC0CN0_ADINT__SET          0x20 ///< ADC0 completed a data conversion.                 
                                                                                                
#define ADC0CN0_ADTM__BMASK         0x40 ///< Track Mode                                        
#define ADC0CN0_ADTM__SHIFT         0x06 ///< Track Mode                                        
#define ADC0CN0_ADTM__TRACK_NORMAL  0x00 ///< Normal Track Mode. When ADC0 is enabled,          
                                         ///< conversion begins immediately following the start-
                                         ///< of-conversion signal.                             
#define ADC0CN0_ADTM__TRACK_DELAYED 0x40 ///< Delayed Track Mode. When ADC0 is enabled,         
                                         ///< conversion begins 3 SAR clock cycles following the
                                         ///< start-of-conversion signal. The ADC is allowed to 
                                         ///< track during this time. Note that there is not a  
                                         ///< tracking delay when the external conversion start 
                                         ///< (CNVSTR) is used as the start-of-conversion       
                                         ///< source.                                           
                                                                                                
