ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB2/inc/SI_EFM8UB2_Register_Enums.h
#define ADC0CN0_ADEN__BMASK         0x80 ///< ADC Enable                                        
#define ADC0CN0_ADEN__SHIFT         0x07 ///< ADC Enable                                        
#define ADC0CN0_ADEN__DISABLED      0x00 ///< ADC0 Disabled (low-power shutdown).               
#define ADC0CN0_ADEN__ENABLED       0x80 ///< ADC0 Enabled (active and ready for data           
                                         ///< conversions).                                     
                                                                                                
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// AMX0N Enums (AMUX0 Negative Multiplexer Selection @ 0xBA)
//------------------------------------------------------------------------------
#define AMX0N_AMX0N__FMASK   0x3F ///< AMUX0 Negative Input Selection
#define AMX0N_AMX0N__SHIFT   0x00 ///< AMUX0 Negative Input Selection
#define AMX0N_AMX0N__ADC0N0  0x00 ///< Select ADC0N.0.               
#define AMX0N_AMX0N__ADC0N1  0x01 ///< Select ADC0N.1.               
#define AMX0N_AMX0N__ADC0N2  0x02 ///< Select ADC0N.2.               
#define AMX0N_AMX0N__ADC0N3  0x03 ///< Select ADC0N.3.               
#define AMX0N_AMX0N__ADC0N4  0x04 ///< Select ADC0N.4.               
#define AMX0N_AMX0N__ADC0N5  0x05 ///< Select ADC0N.5.               
#define AMX0N_AMX0N__ADC0N6  0x06 ///< Select ADC0N.6.               
#define AMX0N_AMX0N__ADC0N7  0x07 ///< Select ADC0N.7.               
#define AMX0N_AMX0N__ADC0N8  0x08 ///< Select ADC0N.8.               
#define AMX0N_AMX0N__ADC0N9  0x09 ///< Select ADC0N.9.               
#define AMX0N_AMX0N__ADC0N10 0x0A ///< Select ADC0N.10.              
#define AMX0N_AMX0N__ADC0N11 0x0B ///< Select ADC0N.11.              
#define AMX0N_AMX0N__ADC0N12 0x0C ///< Select ADC0N.12.              
#define AMX0N_AMX0N__ADC0N13 0x0D ///< Select ADC0N.13.              
#define AMX0N_AMX0N__ADC0N14 0x0E ///< Select ADC0N.14.              
#define AMX0N_AMX0N__ADC0N15 0x0F ///< Select ADC0N.15.              
#define AMX0N_AMX0N__ADC0N16 0x10 ///< Select ADC0N.16.              
#define AMX0N_AMX0N__ADC0N17 0x11 ///< Select ADC0N.17.              
#define AMX0N_AMX0N__ADC0N18 0x12 ///< Select ADC0N.18.              
#define AMX0N_AMX0N__ADC0N19 0x13 ///< Select ADC0N.19.              
#define AMX0N_AMX0N__ADC0N20 0x14 ///< Select ADC0N.20.              
#define AMX0N_AMX0N__ADC0N21 0x15 ///< Select ADC0N.21.              
#define AMX0N_AMX0N__ADC0N22 0x16 ///< Select ADC0N.22.              
#define AMX0N_AMX0N__ADC0N23 0x17 ///< Select ADC0N.23.              
#define AMX0N_AMX0N__ADC0N24 0x18 ///< Select ADC0N.24.              
#define AMX0N_AMX0N__ADC0N25 0x19 ///< Select ADC0N.25.              
#define AMX0N_AMX0N__ADC0N26 0x1A ///< Select ADC0N.26.              
#define AMX0N_AMX0N__ADC0N27 0x1B ///< Select ADC0N.27.              
#define AMX0N_AMX0N__ADC0N28 0x1C ///< Select ADC0N.28.              
#define AMX0N_AMX0N__ADC0N29 0x1D ///< Select ADC0N.29.              
#define AMX0N_AMX0N__VREF    0x1E ///< Internal Voltage Reference.   
#define AMX0N_AMX0N__GND     0x1F ///< Ground (single-ended mode).   
#define AMX0N_AMX0N__ADC0N32 0x20 ///< Select ADC0N.32.              
#define AMX0N_AMX0N__ADC0N33 0x21 ///< Select ADC0N.33.              
#define AMX0N_AMX0N__ADC0N34 0x22 ///< Select ADC0N.34.              
                                                                     
//------------------------------------------------------------------------------
// AMX0P Enums (AMUX0 Positive Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define AMX0P_AMX0P__FMASK   0x3F ///< AMUX0 Positive Input Selection
#define AMX0P_AMX0P__SHIFT   0x00 ///< AMUX0 Positive Input Selection
#define AMX0P_AMX0P__ADC0P0  0x00 ///< Select ADC0P.0.               
#define AMX0P_AMX0P__ADC0P1  0x01 ///< Select ADC0P.1.               
#define AMX0P_AMX0P__ADC0P2  0x02 ///< Select ADC0P.2.               
#define AMX0P_AMX0P__ADC0P3  0x03 ///< Select ADC0P.3.               
#define AMX0P_AMX0P__ADC0P4  0x04 ///< Select ADC0P.4.               
#define AMX0P_AMX0P__ADC0P5  0x05 ///< Select ADC0P.5.               
#define AMX0P_AMX0P__ADC0P6  0x06 ///< Select ADC0P.6.               
#define AMX0P_AMX0P__ADC0P7  0x07 ///< Select ADC0P.7.               
#define AMX0P_AMX0P__ADC0P8  0x08 ///< Select ADC0P.8.               
#define AMX0P_AMX0P__ADC0P9  0x09 ///< Select ADC0P.9.               
#define AMX0P_AMX0P__ADC0P10 0x0A ///< Select ADC0P.10.              
#define AMX0P_AMX0P__ADC0P11 0x0B ///< Select ADC0P.11.              
#define AMX0P_AMX0P__ADC0P12 0x0C ///< Select ADC0P.12.              
#define AMX0P_AMX0P__ADC0P13 0x0D ///< Select ADC0P.13.              
#define AMX0P_AMX0P__ADC0P14 0x0E ///< Select ADC0P.14.              
#define AMX0P_AMX0P__ADC0P15 0x0F ///< Select ADC0P.15.              
#define AMX0P_AMX0P__ADC0P16 0x10 ///< Select ADC0P.16.              
#define AMX0P_AMX0P__ADC0P17 0x11 ///< Select ADC0P.17.              
#define AMX0P_AMX0P__ADC0P18 0x12 ///< Select ADC0P.18.              
#define AMX0P_AMX0P__ADC0P19 0x13 ///< Select ADC0P.19.              
#define AMX0P_AMX0P__ADC0P20 0x14 ///< Select ADC0P.20.              
#define AMX0P_AMX0P__ADC0P21 0x15 ///< Select ADC0P.21.              
#define AMX0P_AMX0P__ADC0P22 0x16 ///< Select ADC0P.22.              
#define AMX0P_AMX0P__ADC0P23 0x17 ///< Select ADC0P.23.              
#define AMX0P_AMX0P__ADC0P24 0x18 ///< Select ADC0P.24.              
#define AMX0P_AMX0P__ADC0P25 0x19 ///< Select ADC0P.25.              
#define AMX0P_AMX0P__ADC0P26 0x1A ///< Select ADC0P.26.              
#define AMX0P_AMX0P__ADC0P27 0x1B ///< Select ADC0P.27.              
#define AMX0P_AMX0P__ADC0P28 0x1C ///< Select ADC0P.28.              
#define AMX0P_AMX0P__ADC0P29 0x1D ///< Select ADC0P.29.              
#define AMX0P_AMX0P__TEMP    0x1E ///< Temperature sensor.           
#define AMX0P_AMX0P__VDD     0x1F ///< VDD Supply Voltage.           
#define AMX0P_AMX0P__ADC0P32 0x20 ///< Select ADC0P.32.              
#define AMX0P_AMX0P__ADC0P33 0x21 ///< Select ADC0P.33.              
#define AMX0P_AMX0P__ADC0P34 0x22 ///< Select ADC0P.34.              
                                                                     
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PFE0CN Enums (Prefetch Engine Control @ 0xAF)
//------------------------------------------------------------------------------
#define PFE0CN_FLBWE__BMASK                0x01 ///< Flash Block Write Enable                      
#define PFE0CN_FLBWE__SHIFT                0x00 ///< Flash Block Write Enable                      
#define PFE0CN_FLBWE__BLOCK_WRITE_DISABLED 0x00 ///< Each byte of a firmware flash write is written
                                                ///< individually.                                 
#define PFE0CN_FLBWE__BLOCK_WRITE_ENABLED  0x01 ///< Flash bytes are written in groups of two.     
                                                                                                   
