ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB2/inc/SI_EFM8UB2_Register_Enums.h
#define EIE1_ET3__BMASK       0x80 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__SHIFT       0x07 ///< Timer 3 Interrupt Enable                          
#define EIE1_ET3__DISABLED    0x00 ///< Disable Timer 3 interrupts.                       
#define EIE1_ET3__ENABLED     0x80 ///< Enable interrupt requests generated by the TF3L or
                                   ///< TF3H flags.                                       
                                                                                          
//------------------------------------------------------------------------------
// EIE2 Enums (Extended Interrupt Enable 2 @ 0xE7)
//------------------------------------------------------------------------------
#define EIE2_EVBUS__BMASK    0x01 ///< VBUS Level Interrupt Enable                       
#define EIE2_EVBUS__SHIFT    0x00 ///< VBUS Level Interrupt Enable                       
#define EIE2_EVBUS__DISABLED 0x00 ///< Disable all VBUS interrupts.                      
#define EIE2_EVBUS__ENABLED  0x01 ///< Enable interrupt requests generated by VBUS level 
                                  ///< sense.                                            
                                                                                         
#define EIE2_ES1__BMASK      0x02 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__SHIFT      0x01 ///< UART1 Interrupt Enable                            
#define EIE2_ES1__DISABLED   0x00 ///< Disable UART1 interrupt.                          
#define EIE2_ES1__ENABLED    0x02 ///< Enable UART1 interrupt.                           
                                                                                         
#define EIE2_ESMB1__BMASK    0x08 ///< SMBus1 Interrupt Enable                           
#define EIE2_ESMB1__SHIFT    0x03 ///< SMBus1 Interrupt Enable                           
#define EIE2_ESMB1__DISABLED 0x00 ///< Disable all SMB1 interrupts.                      
#define EIE2_ESMB1__ENABLED  0x08 ///< Enable interrupt requests generated by SMB1.      
                                                                                         
#define EIE2_ET4__BMASK      0x10 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__SHIFT      0x04 ///< Timer 4 Interrupt Enable                          
#define EIE2_ET4__DISABLED   0x00 ///< Disable Timer 4interrupts.                        
#define EIE2_ET4__ENABLED    0x10 ///< Enable interrupt requests generated by the TF4L or
                                  ///< TF4H flags.                                       
                                                                                         
#define EIE2_ET5__BMASK      0x20 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__SHIFT      0x05 ///< Timer 5 Interrupt Enable                          
#define EIE2_ET5__DISABLED   0x00 ///< Disable Timer 5 interrupts.                       
#define EIE2_ET5__ENABLED    0x20 ///< Enable interrupt requests generated by the TF5L or
                                  ///< TF5H flags.                                       
                                                                                         
//------------------------------------------------------------------------------
// EIP1 Enums (Extended Interrupt Priority 1 @ 0xF6)
//------------------------------------------------------------------------------
#define EIP1_PSMB0__BMASK  0x01 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__SHIFT  0x00 ///< SMBus (SMB0) Interrupt Priority Control                     
#define EIP1_PSMB0__LOW    0x00 ///< SMB0 interrupt set to low priority level.                   
#define EIP1_PSMB0__HIGH   0x01 ///< SMB0 interrupt set to high priority level.                  
                                                                                                 
#define EIP1_PUSB0__BMASK  0x02 ///< USB (USB0) Interrupt Priority Control                       
#define EIP1_PUSB0__SHIFT  0x01 ///< USB (USB0) Interrupt Priority Control                       
#define EIP1_PUSB0__LOW    0x00 ///< USB0 interrupt set to low priority level.                   
#define EIP1_PUSB0__HIGH   0x02 ///< USB0 interrupt set to high priority level.                  
                                                                                                 
#define EIP1_PWADC0__BMASK 0x04 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__SHIFT 0x02 ///< ADC0 Window Comparator Interrupt Priority Control           
#define EIP1_PWADC0__LOW   0x00 ///< ADC0 Window interrupt set to low priority level.            
#define EIP1_PWADC0__HIGH  0x04 ///< ADC0 Window interrupt set to high priority level.           
                                                                                                 
#define EIP1_PADC0__BMASK  0x08 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__SHIFT  0x03 ///< ADC0 Conversion Complete Interrupt Priority Control         
#define EIP1_PADC0__LOW    0x00 ///< ADC0 Conversion Complete interrupt set to low               
                                ///< priority level.                                             
#define EIP1_PADC0__HIGH   0x08 ///< ADC0 Conversion Complete interrupt set to high              
                                ///< priority level.                                             
                                                                                                 
#define EIP1_PPCA0__BMASK  0x10 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__SHIFT  0x04 ///< Programmable Counter Array (PCA0) Interrupt Priority Control
#define EIP1_PPCA0__LOW    0x00 ///< PCA0 interrupt set to low priority level.                   
#define EIP1_PPCA0__HIGH   0x10 ///< PCA0 interrupt set to high priority level.                  
                                                                                                 
#define EIP1_PCP0__BMASK   0x20 ///< Comparator0 (CP0) Interrupt Priority Control                
#define EIP1_PCP0__SHIFT   0x05 ///< Comparator0 (CP0) Interrupt Priority Control                
#define EIP1_PCP0__LOW     0x00 ///< CP0 interrupt set to low priority level.                    
#define EIP1_PCP0__HIGH    0x20 ///< CP0 interrupt set to high priority level.                   
                                                                                                 
