ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB2/inc/SI_EFM8UB2_Register_Enums.h
#define XBR0_CP1E__BMASK      0x40 ///< Comparator1 Output Enable                      
#define XBR0_CP1E__SHIFT      0x06 ///< Comparator1 Output Enable                      
#define XBR0_CP1E__DISABLED   0x00 ///< CP1 unavailable at Port pin.                   
#define XBR0_CP1E__ENABLED    0x40 ///< CP1 routed to Port pin.                        
                                                                                       
#define XBR0_CP1AE__BMASK     0x80 ///< Comparator1 Asynchronous Output Enable         
#define XBR0_CP1AE__SHIFT     0x07 ///< Comparator1 Asynchronous Output Enable         
#define XBR0_CP1AE__DISABLED  0x00 ///< Asynchronous CP1 unavailable at Port pin.      
#define XBR0_CP1AE__ENABLED   0x80 ///< Asynchronous CP1 routed to Port pin.           
                                                                                       
//------------------------------------------------------------------------------
// XBR1 Enums (Port I/O Crossbar 1 @ 0xE2)
//------------------------------------------------------------------------------
#define XBR1_PCA0ME__FMASK                    0x07 ///< PCA Module I/O Enable                            
#define XBR1_PCA0ME__SHIFT                    0x00 ///< PCA Module I/O Enable                            
#define XBR1_PCA0ME__DISABLED                 0x00 ///< All PCA I/O unavailable at Port pins.            
#define XBR1_PCA0ME__CEX0                     0x01 ///< CEX0 routed to Port pin.                         
#define XBR1_PCA0ME__CEX0_CEX1                0x02 ///< CEX0, CEX1 routed to Port pins.                  
#define XBR1_PCA0ME__CEX0_CEX1_CEX2           0x03 ///< CEX0, CEX1, CEX2 routed to Port pins.            
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3      0x04 ///< CEX0, CEX1, CEX2, CEX3 routed to Port pins.      
#define XBR1_PCA0ME__CEX0_CEX1_CEX2_CEX3_CEX4 0x05 ///< CEX0, CEX1, CEX2, CEX3, CEX4 routed to Port pins.
                                                                                                         
#define XBR1_ECIE__BMASK                      0x08 ///< PCA0 External Counter Input Enable               
#define XBR1_ECIE__SHIFT                      0x03 ///< PCA0 External Counter Input Enable               
#define XBR1_ECIE__DISABLED                   0x00 ///< ECI unavailable at Port pin.                     
#define XBR1_ECIE__ENABLED                    0x08 ///< ECI routed to Port pin.                          
                                                                                                         
#define XBR1_T0E__BMASK                       0x10 ///< T0 Enable                                        
#define XBR1_T0E__SHIFT                       0x04 ///< T0 Enable                                        
#define XBR1_T0E__DISABLED                    0x00 ///< T0 unavailable at Port pin.                      
#define XBR1_T0E__ENABLED                     0x10 ///< T0 routed to Port pin.                           
                                                                                                         
#define XBR1_T1E__BMASK                       0x20 ///< T1 Enable                                        
#define XBR1_T1E__SHIFT                       0x05 ///< T1 Enable                                        
#define XBR1_T1E__DISABLED                    0x00 ///< T1 unavailable at Port pin.                      
#define XBR1_T1E__ENABLED                     0x20 ///< T1 routed to Port pin.                           
                                                                                                         
#define XBR1_XBARE__BMASK                     0x40 ///< Crossbar Enable                                  
#define XBR1_XBARE__SHIFT                     0x06 ///< Crossbar Enable                                  
#define XBR1_XBARE__DISABLED                  0x00 ///< Crossbar disabled.                               
#define XBR1_XBARE__ENABLED                   0x40 ///< Crossbar enabled.                                
                                                                                                         
#define XBR1_WEAKPUD__BMASK                   0x80 ///< Port I/O Weak Pullup Disable                     
#define XBR1_WEAKPUD__SHIFT                   0x07 ///< Port I/O Weak Pullup Disable                     
#define XBR1_WEAKPUD__PULL_UPS_ENABLED        0x00 ///< Weak Pullups enabled (except for Ports whose I/O 
                                                   ///< are configured for analog mode).                 
#define XBR1_WEAKPUD__PULL_UPS_DISABLED       0x80 ///< Weak Pullups disabled.                           
                                                                                                         
//------------------------------------------------------------------------------
// XBR2 Enums (Port I/O Crossbar 2 @ 0xE3)
//------------------------------------------------------------------------------
#define XBR2_URT1E__BMASK    0x01 ///< UART1 I/O Output Enable             
#define XBR2_URT1E__SHIFT    0x00 ///< UART1 I/O Output Enable             
#define XBR2_URT1E__DISABLED 0x00 ///< UART1 I/O unavailable at Port pin.  
#define XBR2_URT1E__ENABLED  0x01 ///< UART1 TX, RX routed to Port pins.   
                                                                           
#define XBR2_SMB1E__BMASK    0x02 ///< SMBus1 I/O Enable                   
#define XBR2_SMB1E__SHIFT    0x01 ///< SMBus1 I/O Enable                   
#define XBR2_SMB1E__DISABLED 0x00 ///< SMBus1 I/O unavailable at Port pins.
#define XBR2_SMB1E__ENABLED  0x02 ///< SMBus1 I/O routed to Port pins.     
                                                                           
//------------------------------------------------------------------------------
// PCA0CPH0 Enums (PCA Channel 0 Capture Module High Byte @ 0xFC)
//------------------------------------------------------------------------------
#define PCA0CPH0_PCA0CPH0__FMASK 0xFF ///< PCA Channel 0 Capture Module High Byte
#define PCA0CPH0_PCA0CPH0__SHIFT 0x00 ///< PCA Channel 0 Capture Module High Byte
                                                                                 
//------------------------------------------------------------------------------
// PCA0CPL0 Enums (PCA Channel 0 Capture Module Low Byte @ 0xFB)
//------------------------------------------------------------------------------
#define PCA0CPL0_PCA0CPL0__FMASK 0xFF ///< PCA Channel 0 Capture Module Low Byte
#define PCA0CPL0_PCA0CPL0__SHIFT 0x00 ///< PCA Channel 0 Capture Module Low Byte
                                                                                
//------------------------------------------------------------------------------
// PCA0CPM0 Enums (PCA Channel 0 Capture/Compare Mode @ 0xDA)
//------------------------------------------------------------------------------
#define PCA0CPM0_ECCF__BMASK    0x01 ///< Channel 0 Capture/Compare Flag Interrupt Enable
#define PCA0CPM0_ECCF__SHIFT    0x00 ///< Channel 0 Capture/Compare Flag Interrupt Enable
#define PCA0CPM0_ECCF__DISABLED 0x00 ///< Disable CCF0 interrupts.                       
#define PCA0CPM0_ECCF__ENABLED  0x01 ///< Enable a Capture/Compare Flag interrupt request
                                     ///< when CCF0 is set.                              
                                                                                         
#define PCA0CPM0_PWM__BMASK     0x02 ///< Channel 0 Pulse Width Modulation Mode Enable   
#define PCA0CPM0_PWM__SHIFT     0x01 ///< Channel 0 Pulse Width Modulation Mode Enable   
#define PCA0CPM0_PWM__DISABLED  0x00 ///< Disable PWM function.                          
#define PCA0CPM0_PWM__ENABLED   0x02 ///< Enable PWM function.                           
                                                                                         
#define PCA0CPM0_TOG__BMASK     0x04 ///< Channel 0 Toggle Function Enable               
#define PCA0CPM0_TOG__SHIFT     0x02 ///< Channel 0 Toggle Function Enable               
#define PCA0CPM0_TOG__DISABLED  0x00 ///< Disable toggle function.                       
#define PCA0CPM0_TOG__ENABLED   0x04 ///< Enable toggle function.                        
                                                                                         
#define PCA0CPM0_MAT__BMASK     0x08 ///< Channel 0 Match Function Enable                
#define PCA0CPM0_MAT__SHIFT     0x03 ///< Channel 0 Match Function Enable                
#define PCA0CPM0_MAT__DISABLED  0x00 ///< Disable match function.                        
#define PCA0CPM0_MAT__ENABLED   0x08 ///< Enable match function.                         
                                                                                         
#define PCA0CPM0_CAPN__BMASK    0x10 ///< Channel 0 Capture Negative Function Enable     
#define PCA0CPM0_CAPN__SHIFT    0x04 ///< Channel 0 Capture Negative Function Enable     
#define PCA0CPM0_CAPN__DISABLED 0x00 ///< Disable negative edge capture.                 
#define PCA0CPM0_CAPN__ENABLED  0x10 ///< Enable negative edge capture.                  
                                                                                         
