ahtn/keyplus/ports/efm8/efm8/mcu/EFM8UB2/inc/SI_EFM8UB2_Register_Enums.h
#define VDM0CN_VDMEN__BMASK    0x80 ///< Supply Monitor Enable                           
#define VDM0CN_VDMEN__SHIFT    0x07 ///< Supply Monitor Enable                           
#define VDM0CN_VDMEN__DISABLED 0x00 ///< Supply Monitor Disabled.                        
#define VDM0CN_VDMEN__ENABLED  0x80 ///< Supply Monitor Enabled.                         
                                                                                         
//------------------------------------------------------------------------------
// REF0CN Enums (Voltage Reference Control @ 0xD1)
//------------------------------------------------------------------------------
#define REF0CN_REFBE__BMASK    0x01 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__SHIFT    0x00 ///< Internal Reference Buffer Enable                  
#define REF0CN_REFBE__DISABLED 0x00 ///< Disable the internal reference buffer.            
#define REF0CN_REFBE__ENABLED  0x01 ///< Enable the internal reference buffer. The internal
                                    ///< voltage reference is driven on the VREF pin.      
                                                                                           
#define REF0CN_TEMPE__BMASK    0x04 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__SHIFT    0x02 ///< Temperature Sensor Enable                         
#define REF0CN_TEMPE__DISABLED 0x00 ///< Disable the internal Temperature Sensor.          
#define REF0CN_TEMPE__ENABLED  0x04 ///< Enable the internal Temperature Sensor.           
                                                                                           
#define REF0CN_REFSL__BMASK    0x08 ///< Voltage Reference Select                          
#define REF0CN_REFSL__SHIFT    0x03 ///< Voltage Reference Select                          
#define REF0CN_REFSL__VREF     0x00 ///< Use the VREF pin as the voltage reference.        
#define REF0CN_REFSL__VDD      0x08 ///< Use VDD as the voltage reference.                 
                                                                                           
#define REF0CN_REGOVR__BMASK   0x10 ///< Regulator Reference Override                      
#define REF0CN_REGOVR__SHIFT   0x04 ///< Regulator Reference Override                      
#define REF0CN_REGOVR__REFSL   0x00 ///< The REFSL bit selects the voltage reference       
                                    ///< source.                                           
#define REF0CN_REGOVR__VREG    0x10 ///< Use the output of the internal regulator as the   
                                    ///< voltage reference source.                         
                                                                                           
#define REF0CN_REFBGS__BMASK   0x80 ///< Reference Buffer Gain Select                      
#define REF0CN_REFBGS__SHIFT   0x07 ///< Reference Buffer Gain Select                      
#define REF0CN_REFBGS__GAIN_2  0x00 ///< The on-chip voltage reference buffer gain is 2.   
#define REF0CN_REFBGS__GAIN_1  0x80 ///< The on-chip voltage reference buffer gain is 1.   
                                                                                           
//------------------------------------------------------------------------------
// REG01CN Enums (Voltage Regulator Control @ 0xC9)
//------------------------------------------------------------------------------
#define REG01CN_REG1MD__BMASK     0x02 ///< VREG1 Voltage Regulator Mode                     
#define REG01CN_REG1MD__SHIFT     0x01 ///< VREG1 Voltage Regulator Mode                     
#define REG01CN_REG1MD__NORMAL    0x00 ///< VREG1 Voltage Regulator in normal mode.          
#define REG01CN_REG1MD__LOW_POWER 0x02 ///< VREG1 Voltage Regulator in low power mode.       
                                                                                             
#define REG01CN_STOPCF__BMASK     0x08 ///< VREG1 Stop and Shutdown Mode Configuration       
#define REG01CN_STOPCF__SHIFT     0x03 ///< VREG1 Stop and Shutdown Mode Configuration       
#define REG01CN_STOPCF__ACTIVE    0x00 ///< VREG1 Regulator is still active in stop mode. Any
                                       ///< enabled reset source will reset the device.      
#define REG01CN_STOPCF__SHUTDOWN  0x08 ///< VREG1 Regulator is shut down in stop mode (device
                                       ///< enters Shutdown mode). Only the RSTb pin or power
                                       ///< cycle can reset the device.                      
                                                                                             
#define REG01CN_REG0MD__BMASK     0x10 ///< VREG0 Voltage Regulator Mode                     
#define REG01CN_REG0MD__SHIFT     0x04 ///< VREG0 Voltage Regulator Mode                     
#define REG01CN_REG0MD__NORMAL    0x00 ///< VREG0 Voltage Regulator in normal mode.          
#define REG01CN_REG0MD__LOW_POWER 0x10 ///< VREG0 Voltage Regulator in low power mode.       
                                                                                             
#define REG01CN_VBSTAT__BMASK     0x40 ///< VBUS Signal Status                               
#define REG01CN_VBSTAT__SHIFT     0x06 ///< VBUS Signal Status                               
#define REG01CN_VBSTAT__NOT_SET   0x00 ///< VBUS signal currently absent (device not attached
                                       ///< to USB network).                                 
#define REG01CN_VBSTAT__SET       0x40 ///< VBUS signal currently present (device attached to
                                       ///< USB network).                                    
                                                                                             
#define REG01CN_REG0DIS__BMASK    0x80 ///< Voltage Regulator (REG0) Disable                 
#define REG01CN_REG0DIS__SHIFT    0x07 ///< Voltage Regulator (REG0) Disable                 
#define REG01CN_REG0DIS__ENABLED  0x00 ///< Enable the VREG0 Voltage Regulator.              
#define REG01CN_REG0DIS__DISABLED 0x80 ///< Disable the VREG0 Voltage Regulator.             
                                                                                             
//------------------------------------------------------------------------------
// EMI0CF Enums (External Memory Configuration @ 0x85)
//------------------------------------------------------------------------------
#define EMI0CF_EALE__FMASK                    0x03 ///< ALE Pulse-Width Select                            
#define EMI0CF_EALE__SHIFT                    0x00 ///< ALE Pulse-Width Select                            
#define EMI0CF_EALE__1_CLOCK                  0x00 ///< ALE high and ALE low pulse width = 1 SYSCLK cycle.
#define EMI0CF_EALE__2_CLOCKS                 0x01 ///< ALE high and ALE low pulse width = 2 SYSCLK       
                                                   ///< cycles.                                           
#define EMI0CF_EALE__3_CLOCKS                 0x02 ///< ALE high and ALE low pulse width = 3 SYSCLK       
                                                   ///< cycles.                                           
#define EMI0CF_EALE__4_CLOCKS                 0x03 ///< ALE high and ALE low pulse width = 4 SYSCLK       
                                                   ///< cycles.                                           
                                                                                                          
